TexasInstruments/mspm0-sdk/examples/nortos/LP_MSPM0G3218/iqmath/iqmath_mathacl_ops_test/iqmath_mathacl_ops_test.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 */
//@cliArgs --device "MSPM0G321X" --package "LQFP-48(PT)" --part "Default"
//@v2CliArgs --device "MSPM0G3218" --package "LQFP-48(PT)"
// @cliArgs --board /ti/boards/LP_MSPM0G3218 --rtos nortos

/**
 * Import the modules used in this configuration.
 */
const MATHACL   = scripting.addModule("/ti/driverlib/MATHACL");
const Migration = scripting.addModule("/ti/project_config/ProjectConfig");

/**
 * Write custom configuration values to the imported modules.
 */
const Board = scripting.addModule("/ti/driverlib/Board", {}, false);

const SYSCTL = scripting.addModule("/ti/driverlib/SYSCTL", {}, false);

Migration.genLibIQ        = true;
Migration.genLibIQVersion = "MATHACL";